{"id":"4af6a00a-a240-4cce-8075-f169c46424d3","updated_at":"2025-06-22T14:05:24.337Z","updated_by":"3553104709","created_at":"2025-06-22T14:05:24.337Z","created_by":"3553104709","name":"High Web Traffic Threshold Exceeded","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule triggers an alert when the total web traffic exceeds 2000 requests","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://2177eadfb0ac428aa99faf7ae4aa59e3.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-10m","rule_id":"c5c4a449-e228-4c4e-aa6e-2e4b09cccba1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1046","name":"Network Service Discovery","reference":"https://attack.mitre.org/techniques/T1046/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset : \"zeek.http\" ","filters":[],"threshold":{"field":["source.ip","destination.ip"],"value":1500,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
