{"id":"5c99e4ea-59bd-48e8-996e-7bc5c0f3c946","updated_at":"2025-06-22T13:55:15.921Z","updated_by":"3553104709","created_at":"2025-06-22T13:55:15.921Z","created_by":"3553104709","name":"Web Scanner Activity - Nikto","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects Nikto scanning activity.","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://2177eadfb0ac428aa99faf7ae4aa59e3.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-10m","rule_id":"02b1cace-ef04-4d23-a27c-de379b97ddae","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1046","name":"Network Service Discovery","reference":"https://attack.mitre.org/techniques/T1046/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset : \"zeek.http\" and user_agent.original : *Nikto*","filters":[],"alert_suppression":{"group_by":["destination.ip"],"duration":{"value":5,"unit":"m"},"missing_fields_strategy":"suppress"},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
